In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([
    {"name": "Ania", "age": 20, "height": 160, "weight": 60},
    {"name": "Bartek", "age": 25, "height": 180, "weight": 80},
    {"name": "Czesław", "age": 30, "height": 170, "weight": 70},
    {"name": "Damian", "age": 35, "height": 175, "weight": 75},
],
    index=['pracownik HR 0', 'pracownik HR 1', 'pracownik IT 0','pracownik IT 1',])

df

                   name  age  height  weight
pracownik HR 0     Ania   20     160      60
pracownik HR 1   Bartek   25     180      80
pracownik IT 0  Czesław   30     170      70
pracownik IT 1   Damian   35     175      75

In [3]:
df[['name', 'age']]

                   name  age
pracownik HR 0     Ania   20
pracownik HR 1   Bartek   25
pracownik IT 0  Czesław   30
pracownik IT 1   Damian   35

In [4]:
name_and_age_df = df[['name', 'age']].copy()

name_and_age_df['age'] = name_and_age_df['age'] + 1

name_and_age_df

                   name  age
pracownik HR 0     Ania   21
pracownik HR 1   Bartek   26
pracownik IT 0  Czesław   31
pracownik IT 1   Damian   36

In [5]:
df

                   name  age  height  weight
pracownik HR 0     Ania   20     160      60
pracownik HR 1   Bartek   25     180      80
pracownik IT 0  Czesław   30     170      70
pracownik IT 1   Damian   35     175      75

In [6]:
df[df['weight'] > 70]

                  name  age  height  weight
pracownik HR 1  Bartek   25     180      80
pracownik IT 1  Damian   35     175      75

In [7]:
df[(df['weight'] > 70) & (df['height'] < 180)]

                  name  age  height  weight
pracownik IT 1  Damian   35     175      75

In [8]:
df[(df['weight'] > 70) | (df['height'] < 180)]

                   name  age  height  weight
pracownik HR 0     Ania   20     160      60
pracownik HR 1   Bartek   25     180      80
pracownik IT 0  Czesław   30     170      70
pracownik IT 1   Damian   35     175      75

In [9]:
name_and_age_df = df[['name','age']].copy()

name_and_age_df['age'] = name_and_age_df['age'] + 1

name_and_age_df

                   name  age
pracownik HR 0     Ania   21
pracownik HR 1   Bartek   26
pracownik IT 0  Czesław   31
pracownik IT 1   Damian   36

In [10]:
df

                   name  age  height  weight
pracownik HR 0     Ania   20     160      60
pracownik HR 1   Bartek   25     180      80
pracownik IT 0  Czesław   30     170      70
pracownik IT 1   Damian   35     175      75

In [11]:
df.iloc[1]

name      Bartek
age           25
height       180
weight        80
Name: pracownik HR 1, dtype: object

In [12]:
df.loc['pracownik HR 0']

name      Ania
age         20
height     160
weight      60
Name: pracownik HR 0, dtype: object

: